app/controllers/friend_radar_controller.rb

  def index

    params[:limit] = 3 if params[:limit].blank?

    @friends =  if params[:lat].present? && params[:long].present?
                  Friend.near_of(params[:lat], params[:long]).all(:limit => params[:limit])
---
SELECT *, sqrt( power(lat - 3.0, 2) + power(long - 50.0, 2) ) distance FROM "friends" ORDER BY distance LIMIT 3