app/controllers/friends_controller.rb

SELECT "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT 1  [["id", "1"]]
---
  def load_friend
    if params[:id].present?
      @friend = Friend.find(params[:id])

SELECT "friends".* FROM "friends"
---
  def load_friends
    #filtros de busca devem ir aqui
    @friends = Friend.all

UPDATE "friends" SET "name" = 'Teste123333333333333333333333333333333333333', "updated_at" = '2012-06-04 16:52:46.553384' WHERE "friends"."id" = 1
---
  def update
    @friend.update_attributes!(params[:friend])

INSERT INTO "friends" ("created_at", "lat", "long", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @friend.save!